[Killed] BooleanLiteral
src/auth/auth-strategy.service.ts:80:20
      */
     isAuthenticated(): boolean {
         if (this.authResult === null) {
-            return false;
+            return true;
         }
 
killedBy: AuthStrategyService isAuthenticated() returns false before any authentication has occurred
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/auth/auth-strategy.service.ts:92:49
      * deduplicated {@link performAuthenticate} so concurrent callers share
      * a single underlying handshake.
      */
-    async authenticateIfNeeded(): Promise<void> {
-        if (this.isAuthenticated()) {
-            return;
-        }
-
-        await this.performAuthenticate();
-    }
+    async authenticateIfNeeded(): Promise<void> {}
 
     /**
killedBy: AuthStrategyService isAuthenticated() returns true after a successful authenticateIfNeeded() when the cached strategy is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/auth/auth-strategy.service.ts:93:13
      * a single underlying handshake.
      */
     async authenticateIfNeeded(): Promise<void> {
-        if (this.isAuthenticated()) {
+        if (true) {
             return;
         }
killedBy: AuthStrategyService isAuthenticated() returns true after a successful authenticateIfNeeded() when the cached strategy is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/auth/auth-strategy.service.ts:93:13
      * a single underlying handshake.
      */
     async authenticateIfNeeded(): Promise<void> {
-        if (this.isAuthenticated()) {
+        if (false) {
             return;
         }
killedBy: AuthStrategyService authenticateIfNeeded() skips performAuthenticate when already authenticated (skip-when-authed AC)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/auth/auth-strategy.service.ts:118:23
      * returns `false` and the next {@link authenticateIfNeeded} triggers a
      * fresh handshake. Used by the `@Authenticate` decorator's 401 retry path.
      */
-    clearAuth(): void {
-        this.authResult = null;
-    }
+    clearAuth(): void {}
 
     /**
killedBy: AuthStrategyService clearAuth() resets authResult so a subsequent isAuthenticated() returns false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/auth/auth-strategy.service.ts:134:56
      * essential for single-flight correctness.
      */
     @DeduplicateInflight(() => AUTHENTICATE_DEDUP_KEY)
-    private async performAuthenticate(): Promise<void> {
-        this.authResult = await this.authConfig.authenticate(
-            this.client as Parameters<AuthConfig["authenticate"]>[0],
-        );
-    }
+    private async performAuthenticate(): Promise<void> {}
 }
 
killedBy: AuthStrategyService isAuthenticated() returns true after a successful authenticateIfNeeded() when the cached strategy is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
