[Timeout] ArrayDeclaration
src/client/resailencePolicyBuilder.ts:35:76
     R = unknown, 
     A extends IPolicy<IDefaultPolicyContext, R> = IPolicy<IDefaultPolicyContext, R>
 >(config: ResilanceConfig<T, S, R>): A => {
-    const policies: Array<IPolicy<IDefaultPolicyContext, R> | undefined> = [
-        config.retry && buildRetryPolicy(config.retry),
-        config.circuitBreaker && buildCircuitBreakerPolicy(config.circuitBreaker),
-        config.bulkhead && buildBulkheadPolicy(config.bulkhead),
-        config.fallback && buildFallbackPolicy(config.fallback),
-    ];
+    const policies: Array<IPolicy<IDefaultPolicyContext, R> | undefined> = [];
 
     const filteredPolicies = policies.filter(Boolean) as Array<IPolicy<IDefaultPolicyContext, R>>;

[Killed] ConditionalExpression
src/client/resailencePolicyBuilder.ts:44:9
 
     const filteredPolicies = policies.filter(Boolean) as Array<IPolicy<IDefaultPolicyContext, R>>;
     
-    if (filteredPolicies.length === 0) {
+    if (false) {
         return new NoopPolicy() as unknown as A;
     }
killedBy: resiliencePolicyBuilder empty / single-policy branches returns NoopPolicy when config is empty
statusReason: TypeError: Cannot read properties of undefined (reading 'onFailure')

[Killed] BlockStatement
src/client/resailencePolicyBuilder.ts:44:40
 
     const filteredPolicies = policies.filter(Boolean) as Array<IPolicy<IDefaultPolicyContext, R>>;
     
-    if (filteredPolicies.length === 0) {
-        return new NoopPolicy() as unknown as A;
-    }
+    if (filteredPolicies.length === 0) {}
 
     return wrap(...filteredPolicies) as unknown as A;
killedBy: resiliencePolicyBuilder empty / single-policy branches returns NoopPolicy when config is empty
statusReason: TypeError: Cannot read properties of undefined (reading 'onFailure')

[Killed] ConditionalExpression
src/client/resailencePolicyBuilder.ts:52:5
 }
 
 const isBackoffFactory = (value: unknown): value is IBackoffFactory<IRetryBackoffContext<unknown>> =>
-    typeof value === 'object' &&
-    value !== null &&
-    'next' in value &&
-    typeof (value as { next: unknown }).next === 'function';
+    false;
 
 export const buildRetryPolicy = <T, S = void, R = unknown>(config: RetryConfig<T, S>): RetryPolicy => {
killedBy: resiliencePolicyBuilder buildRetryPolicy backoff polymorphism uses the provided factory when backoff has a `.next()` method
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 7

- Object {
+ ExponentialBackoff {
+   "options": Object {

[Killed] ConditionalExpression
src/client/resailencePolicyBuilder.ts:52:5
 }
 
 const isBackoffFactory = (value: unknown): value is IBackoffFactory<IRetryBackoffContext<unknown>> =>
-    typeof value === 'object' &&
-    value !== null &&
-    'next' in value &&
+    true &&
     typeof (value as { next: unknown }).next === 'function';
 
killedBy: resiliencePolicyBuilder buildRetryPolicy backoff polymorphism uses ExponentialBackoff when backoff is undefined (default branch)
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] EqualityOperator
src/client/resailencePolicyBuilder.ts:55:5
     typeof value === 'object' &&
     value !== null &&
     'next' in value &&
-    typeof (value as { next: unknown }).next === 'function';
+    typeof (value as {
+  next: unknown;
+}).next !== 'function';
 
 export const buildRetryPolicy = <T, S = void, R = unknown>(config: RetryConfig<T, S>): RetryPolicy => {
killedBy: resiliencePolicyBuilder buildRetryPolicy backoff polymorphism uses the provided factory when backoff has a `.next()` method
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 7

- Object {
+ ExponentialBackoff {
+   "options": Object {

[Timeout] ConditionalExpression
src/client/resailencePolicyBuilder.ts:55:5
     typeof value === 'object' &&
     value !== null &&
     'next' in value &&
-    typeof (value as { next: unknown }).next === 'function';
+    true;
 
 export const buildRetryPolicy = <T, S = void, R = unknown>(config: RetryConfig<T, S>): RetryPolicy => {

[Timeout] ObjectLiteral
src/client/resailencePolicyBuilder.ts:66:9
 
     const policy = retry(
         config.shouldRetry ? handleWhen(config.shouldRetry) : handleAll, 
-        { 
-            maxAttempts: config.maxAttempts, 
-            backoff
-        }
+        {}
     );
 

[Timeout] BlockStatement
src/client/resailencePolicyBuilder.ts:72:27
         }
     );
 
-    if (config.onSuccess) {
-        policy.onSuccess(config.onSuccess);
-    }
+    if (config.onSuccess) {}
     if (config.onFailure) {
         policy.onFailure(config.onFailure);

[Timeout] BlockStatement
src/client/resailencePolicyBuilder.ts:75:27
     if (config.onSuccess) {
         policy.onSuccess(config.onSuccess);
     }
-    if (config.onFailure) {
-        policy.onFailure(config.onFailure);
-    }
+    if (config.onFailure) {}
     if (config.onRetry) {
         policy.onRetry(config.onRetry);

[Timeout] BlockStatement
src/client/resailencePolicyBuilder.ts:78:25
     if (config.onFailure) {
         policy.onFailure(config.onFailure);
     }
-    if (config.onRetry) {
-        policy.onRetry(config.onRetry);
-    }
+    if (config.onRetry) {}
     if (config.onGiveUp) {
         policy.onGiveUp(config.onGiveUp);

[Killed] BlockStatement
src/client/resailencePolicyBuilder.ts:81:26
     if (config.onRetry) {
         policy.onRetry(config.onRetry);
     }
-    if (config.onGiveUp) {
-        policy.onGiveUp(config.onGiveUp);
-    }
+    if (config.onGiveUp) {}
 
     return policy;
killedBy: resiliencePolicyBuilder buildRetryPolicy backoff polymorphism invokes onFailure and onGiveUp callbacks after exhausting retries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/client/resailencePolicyBuilder.ts:89:5
 }
 
 const isCountBreakerOptions = (breaker: number | ICountBreakerOptions | ISamplingBreakerOptions): breaker is ICountBreakerOptions =>
-    typeof breaker === 'object' && 'size' in breaker;
+    true;
 
 export const buildCircuitBreakerPolicy = (config: CircuitBreakerConfig): CircuitBreakerPolicy => {
killedBy: AuthRestModule.forRootAsync bootstrap and resolution compiles a TestingModule with useFactory returning httpService + authConfig without throwing
statusReason: Error: expect(received).resolves.toBeDefined()

Received promise rejected instead of resolved
Rejected to value: [RangeError: CountBreaker size should be a positive integer, got undefined]

[Killed] ConditionalExpression
src/client/resailencePolicyBuilder.ts:89:5
 }
 
 const isCountBreakerOptions = (breaker: number | ICountBreakerOptions | ISamplingBreakerOptions): breaker is ICountBreakerOptions =>
-    typeof breaker === 'object' && 'size' in breaker;
+    false;
 
 export const buildCircuitBreakerPolicy = (config: CircuitBreakerConfig): CircuitBreakerPolicy => {
killedBy: resiliencePolicyBuilder buildCircuitBreakerPolicy breaker polymorphism uses CountBreaker when breaker has a `size` field (ICountBreakerOptions)
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: CountBreaker
Received constructor: SamplingBreaker

[Timeout] BlockStatement
src/client/resailencePolicyBuilder.ts:108:25
         }
     );
 
-    if (config.onBreak) {
-        policy.onBreak(config.onBreak);
-    }
+    if (config.onBreak) {}
     if (config.onReset) {
         policy.onReset(config.onReset);

[Survived] BlockStatement
src/client/resailencePolicyBuilder.ts:111:25
     if (config.onBreak) {
         policy.onBreak(config.onBreak);
     }
-    if (config.onReset) {
-        policy.onReset(config.onReset);
-    }
+    if (config.onReset) {}
     if (config.onHalfOpen) {
         policy.onHalfOpen(config.onHalfOpen);

[Timeout] BlockStatement
src/client/resailencePolicyBuilder.ts:114:28
     if (config.onReset) {
         policy.onReset(config.onReset);
     }
-    if (config.onHalfOpen) {
-        policy.onHalfOpen(config.onHalfOpen);
-    }
+    if (config.onHalfOpen) {}
     if (config.onStateChange) {
         policy.onStateChange(config.onStateChange);

[Timeout] BlockStatement
src/client/resailencePolicyBuilder.ts:117:31
     if (config.onHalfOpen) {
         policy.onHalfOpen(config.onHalfOpen);
     }
-    if (config.onStateChange) {
-        policy.onStateChange(config.onStateChange);
-    }
+    if (config.onStateChange) {}
     if (config.onSuccess) {
         policy.onSuccess(config.onSuccess);

[Timeout] BlockStatement
src/client/resailencePolicyBuilder.ts:120:27
     if (config.onStateChange) {
         policy.onStateChange(config.onStateChange);
     }
-    if (config.onSuccess) {
-        policy.onSuccess(config.onSuccess);
-    }
+    if (config.onSuccess) {}
     if (config.onFailure) {
         policy.onFailure(config.onFailure);

[Timeout] BlockStatement
src/client/resailencePolicyBuilder.ts:139:26
     if (config.onFailure) {
         policy.onFailure(config.onFailure);
     }
-    if (config.onReject) {
-        policy.onReject(config.onReject);
-    }
+    if (config.onReject) {}
 
     return policy;

[Killed] EqualityOperator
src/client/resailencePolicyBuilder.ts:147:28
 }
 
 export const buildFallbackPolicy = <R = unknown>(config: FallbackConfig<R>): FallbackPolicy<R> => {
-    const valueOrFactory = typeof config.valueOrFactory === 'function'
+    const valueOrFactory = typeof config.valueOrFactory !== 'function'
         ? config.valueOrFactory as () => Promise<R> | R
         : () => config.valueOrFactory as R;
killedBy: resiliencePolicyBuilder buildFallbackPolicy uses the supplied factory function when valueOrFactory is callable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "computed-fallback"
Received: [Function mockConstructor]

[Survived] ConditionalExpression
src/client/resailencePolicyBuilder.ts:147:28
 }
 
 export const buildFallbackPolicy = <R = unknown>(config: FallbackConfig<R>): FallbackPolicy<R> => {
-    const valueOrFactory = typeof config.valueOrFactory === 'function'
+    const valueOrFactory = true
         ? config.valueOrFactory as () => Promise<R> | R
         : () => config.valueOrFactory as R;
