[Killed] BooleanLiteral
src/shouldRetry.ts:20:16
 export function isRetryableError(error: Error, methods: string[] = SAFE_HTTP_METHODS): boolean {
     // Not an axios error - retry (types/parsing error)
     if (!isAxiosError(error)) {
-        return true;
+        return false;
     }
 
killedBy: shouldRetry isRetryableError non-axios errors returns true for plain Error (treated as internal/parsing error)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/shouldRetry.ts:24:42
     }
 
     // Retry only for idempotent methods
-    if (!isMethodInList(error, methods)) {
-        return false;
-    }
+    if (!isMethodInList(error, methods)) {}
 
     // Network/timeout errors (no response)
killedBy: shouldRetry isRetryableError safe HTTP method allow-list (default SAFE_HTTP_METHODS) returns false for POST with 5xx server error (not in allow-list)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/shouldRetry.ts:24:9
     }
 
     // Retry only for idempotent methods
-    if (!isMethodInList(error, methods)) {
+    if (false) {
         return false;
     }
killedBy: RestClient default preset (constructor with no `config`) does NOT retry non-safe methods (e.g. POST 5xx) under the CONSERVATIVE preset
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 4

[Timeout] BooleanLiteral
src/shouldRetry.ts:25:16
 
     // Retry only for idempotent methods
     if (!isMethodInList(error, methods)) {
-        return false;
+        return true;
     }
 

[Killed] BooleanLiteral
src/shouldRetry.ts:36:16
     const method = error.config?.method;
     if (!method) {
         // Cannot determine if the request can be retried
-        return false;
+        return true;
     }
 
killedBy: shouldRetry isRetryableError missing config / method returns false when axios error has no config.method (cannot determine)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/shouldRetry.ts:39:26
         return false;
     }
 
-    return list.includes(method.toUpperCase());
+    return list.includes(method.toLowerCase());
 }
 
killedBy: resilience policy presets safeMethodsRetry retries safe HTTP methods (GET/HEAD/OPTIONS) on 5xx
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/shouldRetry.ts:43:12
 }
 
 export function isNetworkOrInternalError(error: AxiosError): boolean {
-    return isNetworkError(error) || isInternalError(error);
+    return true;
 }
 
killedBy: shouldRetry isRetryableError CODE_EXCLUDE_LIST (cancellations and SSL/cert failures) returns false when code is ECONNABORTED on a network error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/shouldRetry.ts:43:12
 }
 
 export function isNetworkOrInternalError(error: AxiosError): boolean {
-    return isNetworkError(error) || isInternalError(error);
+    return false;
 }
 
killedBy: AuthRestModule.forRootAsync default-preset fallback (factory omits `resilanceConfig`) behavioural: GET 5xx through the module-provided RestClient retries up to maxAttempts=3 (4 total axios calls)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 1

[Survived] ConditionalExpression
src/shouldRetry.ts:85:9
 ];
 
 export function isNetworkError(error: AxiosError) {
-    if (error.response) {
+    if (false) {
         return false;
     }

[Timeout] BlockStatement
src/shouldRetry.ts:85:25
 ];
 
 export function isNetworkError(error: AxiosError) {
-    if (error.response) {
-        return false;
-    }
+    if (error.response) {}
     if (!error.code) {
         return false;

[Killed] BooleanLiteral
src/shouldRetry.ts:86:16
 
 export function isNetworkError(error: AxiosError) {
     if (error.response) {
-        return false;
+        return true;
     }
     if (!error.code) {
killedBy: shouldRetry isNetworkError returns false when there is a response (HTTP-level error, not network)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/shouldRetry.ts:89:16
         return false;
     }
     if (!error.code) {
-        return false;
+        return true;
     }
     // Prevents retrying unsafe errors
killedBy: shouldRetry isNetworkError returns false when there is no code (cannot classify)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/shouldRetry.ts:92:9
         return false;
     }
     // Prevents retrying unsafe errors
-    if (CODE_EXCLUDE_LIST.includes(error.code)) {
+    if (false) {
         return false;
     }
killedBy: shouldRetry isRetryableError CODE_EXCLUDE_LIST (cancellations and SSL/cert failures) returns false when code is ECONNABORTED on a network error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Timeout] BlockStatement
src/shouldRetry.ts:92:49
         return false;
     }
     // Prevents retrying unsafe errors
-    if (CODE_EXCLUDE_LIST.includes(error.code)) {
-        return false;
-    }
+    if (CODE_EXCLUDE_LIST.includes(error.code)) {}
     
     return true;

[Killed] BooleanLiteral
src/shouldRetry.ts:93:16
     }
     // Prevents retrying unsafe errors
     if (CODE_EXCLUDE_LIST.includes(error.code)) {
-        return false;
+        return true;
     }
     
killedBy: shouldRetry isRetryableError CODE_EXCLUDE_LIST (cancellations and SSL/cert failures) returns false when code is ECONNABORTED on a network error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/shouldRetry.ts:102:9
 
 export function isInternalError(error: AxiosError): boolean {
     return (
-        error.code !== 'ECONNABORTED' &&
-        (!error.response ||
-            error.response.status !== undefined ||
-            error.response.status === 429 ||
-            (error.response.status >= 500 && error.response.status <= 599))
+        true
     );
 }
killedBy: shouldRetry isRetryableError CODE_EXCLUDE_LIST (cancellations and SSL/cert failures) returns false when code is ECONNABORTED on a network error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/shouldRetry.ts:102:9
 
 export function isInternalError(error: AxiosError): boolean {
     return (
-        error.code !== 'ECONNABORTED' &&
+        true &&
         (!error.response ||
             error.response.status !== undefined ||
killedBy: shouldRetry isRetryableError CODE_EXCLUDE_LIST (cancellations and SSL/cert failures) returns false when code is ECONNABORTED on a network error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Timeout] ConditionalExpression
src/shouldRetry.ts:103:10
 export function isInternalError(error: AxiosError): boolean {
     return (
         error.code !== 'ECONNABORTED' &&
-        (!error.response ||
-            error.response.status !== undefined ||
-            error.response.status === 429 ||
-            (error.response.status >= 500 && error.response.status <= 599))
+        (true)
     );
 }

[Killed] EqualityOperator
src/shouldRetry.ts:104:13
     return (
         error.code !== 'ECONNABORTED' &&
         (!error.response ||
-            error.response.status !== undefined ||
+            error.response.status === undefined ||
             error.response.status === 429 ||
             (error.response.status >= 500 && error.response.status <= 599))
killedBy: shouldRetry isInternalError returns true for 4xx response status (status is defined, not ECONNABORTED)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/shouldRetry.ts:104:13
     return (
         error.code !== 'ECONNABORTED' &&
         (!error.response ||
-            error.response.status !== undefined ||
+            false ||
             error.response.status === 429 ||
             (error.response.status >= 500 && error.response.status <= 599))
killedBy: shouldRetry isInternalError returns true for 4xx response status (status is defined, not ECONNABORTED)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/shouldRetry.ts:105:13
         error.code !== 'ECONNABORTED' &&
         (!error.response ||
             error.response.status !== undefined ||
-            error.response.status === 429 ||
+            error.response.status !== 429 ||
             (error.response.status >= 500 && error.response.status <= 599))
     );
killedBy: shouldRetry isInternalError returns false when error.response exists but status is undefined and code is not ECONNABORTED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Timeout] ConditionalExpression
src/shouldRetry.ts:105:13
         error.code !== 'ECONNABORTED' &&
         (!error.response ||
             error.response.status !== undefined ||
-            error.response.status === 429 ||
+            false ||
             (error.response.status >= 500 && error.response.status <= 599))
     );

[Survived] LogicalOperator
src/shouldRetry.ts:106:14
         (!error.response ||
             error.response.status !== undefined ||
             error.response.status === 429 ||
-            (error.response.status >= 500 && error.response.status <= 599))
+            (error.response.status >= 500 || error.response.status <= 599))
     );
 }

[NoCoverage] EqualityOperator
src/shouldRetry.ts:106:46
         (!error.response ||
             error.response.status !== undefined ||
             error.response.status === 429 ||
-            (error.response.status >= 500 && error.response.status <= 599))
+            (error.response.status >= 500 && error.response.status > 599))
     );
 }
