[Killed] ConditionalExpression
src/auth/authenticate.decorator.ts:80:7
  */
 function configArgIndex(propertyKey: string | symbol): number {
   const key = String(propertyKey)
-  if (CONFIG_AT_INDEX_1.has(key)) {
+  if (true) {
     return 1
   }
killedBy: AuthRestClient per-verb argument forwarding with explicit config post forwards (url, data, config) to the underlying RestClient with merged Authorization header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/path",
  Object {
+   "headers": Object {

[Killed] BlockStatement
src/auth/authenticate.decorator.ts:80:35
  */
 function configArgIndex(propertyKey: string | symbol): number {
   const key = String(propertyKey)
-  if (CONFIG_AT_INDEX_1.has(key)) {
-    return 1
-  }
+  if (CONFIG_AT_INDEX_1.has(key)) {}
   if (CONFIG_AT_INDEX_2.has(key)) {
     return 2
killedBy: AuthRestClient verb forwarding forwards request to the underlying RestClient exactly once
statusReason: Error: @Authenticate: unsupported method "request". Expected one of: get, delete, head, options, request, post, put, patch, postForm, putForm, patchForm.

[Killed] ConditionalExpression
src/auth/authenticate.decorator.ts:83:7
   if (CONFIG_AT_INDEX_1.has(key)) {
     return 1
   }
-  if (CONFIG_AT_INDEX_2.has(key)) {
+  if (false) {
     return 2
   }
killedBy: AuthRestClient verb forwarding forwards post to the underlying RestClient exactly once
statusReason: Error: @Authenticate: unsupported method "post". Expected one of: get, delete, head, options, request, post, put, patch, postForm, putForm, patchForm.

[Killed] ConditionalExpression
src/auth/authenticate.decorator.ts:83:7
   if (CONFIG_AT_INDEX_1.has(key)) {
     return 1
   }
-  if (CONFIG_AT_INDEX_2.has(key)) {
+  if (true) {
     return 2
   }
killedBy: Authenticate decorator (b3) unsupported verb throws throws an error when applied to an unrecognised HTTP verb
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "ok"

[Timeout] BlockStatement
src/auth/authenticate.decorator.ts:164:11
       await strategy.authenticateIfNeeded()
       const firstAttemptArgs = extendConfigAtIndex(args, idx, strategy)
 
-      try {
-        return await method(...firstAttemptArgs)
-      }
+      try {}
       catch (error) {
         if (isAxiosError(error) && error.response?.status === 401) {

[Killed] BlockStatement
src/auth/authenticate.decorator.ts:167:21
       try {
         return await method(...firstAttemptArgs)
       }
-      catch (error) {
-        if (isAxiosError(error) && error.response?.status === 401) {
-          // Single re-auth attempt: drop cached credentials, re-authenticate, and
-          // re-extend the ORIGINAL args (not the first-attempt args) so the new
-          // credentials replace any stale Authorization header from the prior try.
-          strategy.clearAuth()
-          await strategy.authenticateIfNeeded()
-          const retryArgs = extendConfigAtIndex(args, idx, strategy)
-          return await method(...retryArgs)
-        }
-        throw error
-      }
+      catch (error) {}
     },
     AUTHENTICATE_KEY,
killedBy: AuthRestClient 401 first, success second triggers exactly two underlying RestClient calls and invokes authenticateIfNeeded twice
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/auth/authenticate.decorator.ts:168:68
         return await method(...firstAttemptArgs)
       }
       catch (error) {
-        if (isAxiosError(error) && error.response?.status === 401) {
-          // Single re-auth attempt: drop cached credentials, re-authenticate, and
-          // re-extend the ORIGINAL args (not the first-attempt args) so the new
-          // credentials replace any stale Authorization header from the prior try.
-          strategy.clearAuth()
-          await strategy.authenticateIfNeeded()
-          const retryArgs = extendConfigAtIndex(args, idx, strategy)
-          return await method(...retryArgs)
-        }
+        if (isAxiosError(error) && error.response?.status === 401) {}
         throw error
       }
killedBy: AuthRestClient 401 first, success second triggers exactly two underlying RestClient calls and invokes authenticateIfNeeded twice
statusReason: Error: Request failed with status code 401

[Killed] ConditionalExpression
src/auth/authenticate.decorator.ts:168:36
         return await method(...firstAttemptArgs)
       }
       catch (error) {
-        if (isAxiosError(error) && error.response?.status === 401) {
+        if (isAxiosError(error) && true) {
           // Single re-auth attempt: drop cached credentials, re-authenticate, and
           // re-extend the ORIGINAL args (not the first-attempt args) so the new
killedBy: AuthRestClient 500 error path rethrows the 500 and invokes authenticateIfNeeded exactly once (pre-flight only)
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"data": "ok"}
