[Killed] StringLiteral
src/axios.ts:5:16
 
 export function getRequestRoute(error: unknown): string {
     if (!isAxiosError(error) || !error.config) {
-        return 'unknown';
+        return "";
     }
     
killedBy: getRequestRoute non-axios / missing config short-circuit returns the literal string "unknown" for a plain Error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unknown"
Received: ""

[Killed] MethodExpression
src/axios.ts:9:20
     }
     
     const { config } = error;
-    const method = config.method?.toUpperCase();
+    const method = config.method?.toLowerCase();
     const url = config.url;
     const queryString = config.params ? '?' + new URLSearchParams(config.params as Record<string, string>).toString() : '';
killedBy: getRequestRoute method + url formatting returns "METHOD URL" with method uppercased and no querystring
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "GET https://api.example.com/users"
Received: "get https://api.example.com/users"
