[Killed] ArrowFunction
src/auth/auth-rest.module.ts:140:23
         //    options object (omitted vs. explicitly `undefined`).
         {
           provide: RestClient,
-          useFactory: (opts: AuthRestModuleOptions): RestClient =>
-            new RestClient(
-              opts.httpService,
-              opts.resilanceConfig
-                ?? resiliencePolicyPresets[ResilencePresets.CONSERVATIVE],
-            ),
+          useFactory: () => undefined,
           inject: [AUTH_MODULE_OPTIONS],
         },
killedBy: AuthRestModule.forRootAsync bootstrap and resolution module.get(RestClient) returns a RestClient instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: RestClient

Received value has no prototype
Received value: undefined

[Killed] LogicalOperator
src/auth/auth-rest.module.ts:143:15
           useFactory: (opts: AuthRestModuleOptions): RestClient =>
             new RestClient(
               opts.httpService,
-              opts.resilanceConfig
-                ?? resiliencePolicyPresets[ResilencePresets.CONSERVATIVE],
+              opts.resilanceConfig && resiliencePolicyPresets[ResilencePresets.CONSERVATIVE],
             ),
           inject: [AUTH_MODULE_OPTIONS],
killedBy: AuthRestModule.forRootAsync explicit `resilanceConfig` override factory-supplied resilanceConfig replaces the CONSERVATIVE default in the resolved RestClient.policy
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Survived] ArrowFunction
src/auth/auth-rest.module.ts:153:23
         //    resilience policy stack as application calls.
         {
           provide: AuthStrategyService,
-          useFactory: (
-            opts: AuthRestModuleOptions,
-            client: RestClient,
-          ): AuthStrategyService =>
-            new AuthStrategyService(opts.authConfig, client),
+          useFactory: () => undefined,
           inject: [AUTH_MODULE_OPTIONS, RestClient],
         },

[Killed] ArrayDeclaration
src/auth/auth-rest.module.ts:158:19
             client: RestClient,
           ): AuthStrategyService =>
             new AuthStrategyService(opts.authConfig, client),
-          inject: [AUTH_MODULE_OPTIONS, RestClient],
+          inject: [],
         },
         // 4. AuthRestClient: top-level facade composed from the two
killedBy: AuthRestModule.forRootAsync bootstrap and resolution compiles a TestingModule with useFactory returning httpService + authConfig without throwing
statusReason: Error: expect(received).resolves.toBeDefined()

Received promise rejected instead of resolved
Rejected to value: [TypeError: Cannot read properties of undefined (reading 'authConfig')]

[Killed] ArrowFunction
src/auth/auth-rest.module.ts:164:23
         //    collaborators above.
         {
           provide: AuthRestClient,
-          useFactory: (
-            client: RestClient,
-            strategy: AuthStrategyService,
-          ): AuthRestClient => new AuthRestClient(client, strategy),
+          useFactory: () => undefined,
           inject: [RestClient, AuthStrategyService],
         },
killedBy: AuthRestModule.forRootAsync bootstrap and resolution module.get(AuthRestClient) returns an AuthRestClient instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: AuthRestClient

Received value has no prototype
Received value: undefined

[Survived] ArrayDeclaration
src/auth/auth-rest.module.ts:174:16
       // Both `AuthRestClient` (the authenticated facade) and `RestClient`
       // (the underlying resilient transport) are exported so consumers can
       // inject either depending on whether they need the auth layer.
-      exports: [AuthRestClient, RestClient],
+      exports: [],
     }
   }
