[Killed] BlockStatement
src/client/execute-with-policy.decorator.ts:65:50
 function ExecuteWithPolicy() {
   return Wrap<ExecuteWithPolicyHost, any[], any>(
-    (method, context) => (...args: unknown[]) => {
-      return context.target.policy.execute(async (policyCtx) => {
-        // Forward cockatiel's abort signal into axios on the generic `request`
-        // path so retries/circuit-breakers can cancel in-flight requests. Other
-        // verb helpers do not currently forward the signal: their config arg
-        // position differs and would require per-method handling.
-        const finalArgs = context.propertyKey === 'request'
-          ? [{ ...((args[0] as object | undefined) ?? {}), signal: policyCtx.signal }, ...args.slice(1)]
-          : args
-
-        const result = method(...finalArgs)
-
-        // The original method always returns an Observable<AxiosResponse>; the
-        // `any` return type exists only to satisfy the decorator's variance
-        // check on `TypedPropertyDescriptor`.
-        return isObservable(result) ? await firstValueFrom(result) : await result
-      })
-    },
+    (method, context) => (...args: unknown[]) => {},
     EXECUTE_WITH_POLICY_KEY,
   )
killedBy: AuthRestModule.forRootAsync default-preset fallback (factory omits `resilanceConfig`) behavioural: GET 5xx through the module-provided RestClient retries up to maxAttempts=3 (4 total axios calls)
statusReason: TypeError: Cannot read properties of undefined (reading 'catch')

[Killed] BlockStatement
src/client/execute-with-policy.decorator.ts:66:65
   return Wrap<ExecuteWithPolicyHost, any[], any>(
     (method, context) => (...args: unknown[]) => {
-      return context.target.policy.execute(async (policyCtx) => {
-        // Forward cockatiel's abort signal into axios on the generic `request`
-        // path so retries/circuit-breakers can cancel in-flight requests. Other
-        // verb helpers do not currently forward the signal: their config arg
-        // position differs and would require per-method handling.
-        const finalArgs = context.propertyKey === 'request'
-          ? [{ ...((args[0] as object | undefined) ?? {}), signal: policyCtx.signal }, ...args.slice(1)]
-          : args
-
-        const result = method(...finalArgs)
-
-        // The original method always returns an Observable<AxiosResponse>; the
-        // `any` return type exists only to satisfy the decorator's variance
-        // check on `TypedPropertyDescriptor`.
-        return isObservable(result) ? await firstValueFrom(result) : await result
-      })
+      return context.target.policy.execute(async (policyCtx) => {})
     },
     EXECUTE_WITH_POLICY_KEY,
killedBy: AuthRestModule.forRootAsync default-preset fallback (factory omits `resilanceConfig`) behavioural: GET 5xx through the module-provided RestClient retries up to maxAttempts=3 (4 total axios calls)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 0

[Killed] EqualityOperator
src/client/execute-with-policy.decorator.ts:71:27
         // path so retries/circuit-breakers can cancel in-flight requests. Other
         // verb helpers do not currently forward the signal: their config arg
         // position differs and would require per-method handling.
-        const finalArgs = context.propertyKey === 'request'
+        const finalArgs = context.propertyKey !== 'request'
           ? [{ ...((args[0] as object | undefined) ?? {}), signal: policyCtx.signal }, ...args.slice(1)]
           : args
killedBy: RestClient per-verb policy pass-through (mock policy + axios) passes verb-specific arguments straight through to the underlying httpService
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/items",
  {"headers": {"x-id": "g"}},

[Killed] ConditionalExpression
src/client/execute-with-policy.decorator.ts:71:27
         // path so retries/circuit-breakers can cancel in-flight requests. Other
         // verb helpers do not currently forward the signal: their config arg
         // position differs and would require per-method handling.
-        const finalArgs = context.propertyKey === 'request'
+        const finalArgs = true
           ? [{ ...((args[0] as object | undefined) ?? {}), signal: policyCtx.signal }, ...args.slice(1)]
           : args
killedBy: RestClient per-verb policy pass-through (mock policy + axios) passes verb-specific arguments straight through to the underlying httpService
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/items",
  {"headers": {"x-id": "g"}},

[Timeout] LogicalOperator
src/client/execute-with-policy.decorator.ts:72:20
         // verb helpers do not currently forward the signal: their config arg
         // position differs and would require per-method handling.
         const finalArgs = context.propertyKey === 'request'
-          ? [{ ...((args[0] as object | undefined) ?? {}), signal: policyCtx.signal }, ...args.slice(1)]
+          ? [{ ...(args[0] as object | undefined && {}), signal: policyCtx.signal }, ...args.slice(1)]
           : args
 

[Survived] MethodExpression
src/client/execute-with-policy.decorator.ts:72:91
         // verb helpers do not currently forward the signal: their config arg
         // position differs and would require per-method handling.
         const finalArgs = context.propertyKey === 'request'
-          ? [{ ...((args[0] as object | undefined) ?? {}), signal: policyCtx.signal }, ...args.slice(1)]
+          ? [{ ...((args[0] as object | undefined) ?? {}), signal: policyCtx.signal }, ...args]
           : args
 
