[Killed] ConditionalExpression
src/deduplicate-inflight.decorator.ts:42:9
     const key = keyBuilder(...args)
 
     const existing = context.target.inflightMap.get(key)
-    if (existing) {
+    if (true) {
       return existing
     }
killedBy: AuthStrategyService isAuthenticated() returns true after a successful authenticateIfNeeded() when the cached strategy is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] ConditionalExpression
src/deduplicate-inflight.decorator.ts:42:9
     const key = keyBuilder(...args)
 
     const existing = context.target.inflightMap.get(key)
-    if (existing) {
+    if (false) {
       return existing
     }

[Timeout] BlockStatement
src/deduplicate-inflight.decorator.ts:50:9
 
     context.target.inflightMap.set(key, promise)
 
-    try {
-      return await promise
-    }
+    try {}
     finally {
       context.target.inflightMap.delete(key)

[Killed] BlockStatement
src/deduplicate-inflight.decorator.ts:53:13
     try {
       return await promise
     }
-    finally {
-      context.target.inflightMap.delete(key)
-    }
+    finally {}
   }, INFLIGHT_EXCLUSION_KEY)
 }
killedBy: AuthStrategyService authenticateIfNeeded() re-authenticates when the cached strategy reports it is no longer authenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1
